
// Дана строка, состоящая из строчных латинских букв. Мы хотим разбить её на максимальное количество
// подстрок так, чтобы каждая буква встречалась не более чем в одной подстроке. Верните
// вектор размеров этих подстрок.

// Примеры:
// Ввод: ababcbacadefegdehijhklij
// Вывод: [9, 7, 8]
// Пояснение - строка разбивается на подстроки "ababcbaca", "defegde", "hijhklij"
//
// Ввод: aaabbbab
// Вывод: [8]
//
// Ввод: abcad
// Вывод: [4, 1]
// Пояснение - строка разбивается на подстроки "abca", "d"

#include <iostream>

int main(int argc, char *argv[]) {
    return 0;
}